
"AX_SLEEP_ICON_DESCRIPTION"	= "Mene nukkumaan -symboli";
"AX_RESTART_ICON_DESCRIPTION" = "Käynnistä symboli uudelleen";
"AX_SHUTDOWN_ICON_DESCRIPTION" = "Sammuta-symboli";

/* Alert panel button title. */
/*"Cancel"		=	"Cancel";*/

/* Title of alert to confirm shutting down the computer. */
/*"Power"			= 	"Shut Down";*/

/* Title of default button in alert to confirm shutting down the computer. */
/*"Power Off"		=	"Shut Down";*/

/* Title of alert to confirm restarting the computer. */
/*"Restart"		=	"Restart";*/

/* Message in alert to confirm restarting the computer. */
/*"Restart Message"	=	"Are you sure you want to restart your computer now?";*/


/* Default UNC notification button title */
"OK"			=	"OK"; 


/**********Logout Messages For Fast Logout**************/
"LOGGING_OUT"	= 	"Kirjaudutaan ulos";

"SHUTTING_DOWN"	=	"Sammutetaan";

"RESTARTING"	=	"Käynnistetään uudelleen";

/********************************************************/


/* Message in alert to confirm force quitting an application. Parameter is the name of an application.*/
"FORCE_QUIT_ALERT_MESSAGE"	= 	"Haluatko varmasti pakottaa ohjelman %@ lopettamaan?";
"FORCE_QUIT_INFO_MESSAGE"	=	"Kaikki tallentamattomat muutokset menetetään.";

/* Message in alert to confirm force quitting of multiple applecations*/
"FORCE_QUIT_ALERT_MESSAGE_MULTIPLE_APPS" = "Haluatko pakottaa valitut %ld ohjelmaa lopettamaan?";
"FORCE_QUIT_INFO_MESSAGE_MULTIPLE_APPS"	=	"Kaikki tallentamattomat muutokset menetetään.";


/*loMem specific text*/

"LOMEM_MESSAGE_TEXT" = "Voit vapauttaa lisää muistia valitsemalla ohjelman ja osoittamalla Pakota lopettamaan.";

"NORMAL_MESSAGE_TEXT" = "Jos ohjelma ei vastaa enää komentoihin, valitse se luettelosta ja osoita Pakota lopettamaan.";

"LOMEM_INFO_TEXT" = "Myös ikkunoiden sulkeminen ja tiedostojen poistaminen käynnistyslevyltä auttaa.";

"NORMAL_INFO_TEXT" = "Voit avata tämän ikkunan painamalla\nKomento-Optio-Esc.";

/* This text MAY be used IF HI decides we need to offer a normal quit option in addition to a force quit option for the lomem panel */
/*  Added prior to loc freeze for Tiger.  If it doesn't get used, it can be deleted post Tiger */
"LOMEM_ALTERNATE_FORCE_QUIT_BUTTON_NAME" = "Pakota lopettamaan";


/**** logout Failues *****/

/* Alert text when an app times out. Parameter is the name of an application.*/


"TIMED_OUT_ALERT_MESSAGE"	= "Et ole kirjautunut ulos, koska ohjelma %@ ei sammu. Yritä uloskirjautumista uudelleen lopettamalla ohjelma %@ ja valitse Kirjaudu ulos Apple-valikosta.";
"TIMED_OUT_ALERT_MESSAGE_UNKNOWN"	= "Et ole kirjautunut ulos, koska ohjelma ei sammu. ";

/* Info text when an app times out*/
"TIMED_OUT_INFO_MESSAGE"	= "Lopettaaksesi ohjelman, joka ei vastaa, valitse Pakota lopettamaan Apple-valikosta (tai paina Cmd-Optio-Esc).";

"TIMED_OUT_NOT_RESPONDING_MESSAGE" = "Ohjelma %@ ei sammunut eikä vastaa.";

/* Alert text when an app Cancels. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE"	 = "Ohjelma %@ kumosi uloskirjautumisen.";

/* Alert text when an unknown app Cancels. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE_UNKNOWN"	 = "Ohjelma on kumonnut uloskirjautumisen.";

/* Main message of alert displayed when a known app cancels logout leading to FileVault encryption */
"KNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_ENCRYPTION_MESSAGE" = "Ohjelma %@ kumosi uloskirjautumisen. Tämän tunnuksen FileVaultia ei kytketä päälle.";

/* Main message of alert displayed when an unknown app cancels logout leading to FileVault encryption */
"UNKNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_ENCRYPTION_MESSAGE" = "Ohjelma kumosi uloskirjautumisen. FileVaultia ei kytketä päälle tälle tunnukselle.";

/* Info text of alert displayed when an app cancels logout leading to FileVault encryption */
"APP_CANCELED_LOGOUT_TO_FILE_VAULT_ENCRYPTION_INFO_TEXT" = "Tunnus jätetään salaamatta. Jos haluat FileVaultin päälle, avaa Järjestelmäasetukset ja aloita alusta. Jos asetit juuri pääsalasanan, sitä ei tarvitse asettaa uudelleen.";

/* Main message of alert displayed when a known app cancels logout leading to FileVault decryption */
"KNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_DECRYPTION_MESSAGE" = "Ohjelma %@ kumosi uloskirjautumisen. FileVaultia ei kytketä pois päältä tältä tunnukselta.";

/* Main message of alert displayed when an unknown app cancels logout leading to FileVault decryption */
"UNKNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_DECRYPTION_MESSAGE" = "Ohjelma kumosi uloskirjautumisen. FileVaultia ei kytketä pois päältä tältä tunnukselta.";

"KNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_CONVERSION_MESSAGE" = "Ohjelma %@ keskeytti uloskirjautumisen. Tunnuksen FileVaultia ei muunneta.";

"UNKNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_CONVERSION_MESSAGE" = "Ohjelma keskeytti uloskirjautumisen. Tunnuksen FileVaultia ei muunneta.";

/* Info text of alert displayed when an app cancels logout leading to FileVault decryption */
"APP_CANCELED_LOGOUT_TO_FILE_VAULT_DECRYPTION_INFO_TEXT" = "Tunnus jätetään salatuksi. Jos haluat FileVaultin pois päältä, avaa Järjestelmäasetukset ja aloita alusta.";

"APP_CANCELED_LOGOUT_TO_FILE_VAULT_CONVERSION_INFO_TEXT" = "Tunnus jätetään alkuperäiseen muotoonsa. Jos haluat muuntaa sen FileVault-muotoon, avaa Järjestelmäasetukset ja yritä uudelleen.";

/* Info text when an app Cancels. Parameter is the name of an application.*/
"CANCELLED_INFO_MESSAGE"	 = "Yritä uudelleen lopettamalla ohjelma %@ ja valitsemalla Omenavalikosta Kirjaudu ulos.";
"CANCELLED_INFO_MESSAGE_UNKNOWN"	 = "Yritä uudelleen valitsemalla Omenavalikosta Kirjaudu ulos.";

/* Alert text when an app cancels restart. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE_RESTART"	 = "Ohjelma %@ kumosi uudelleenkäynnistyksen.";

/* Alert text when an unknown app cancels restart. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE_UNKNOWN_RESTART"	 = "Ohjelma on kumonnut uudelleenkäynnistyksen.";

/* Info text when an app cancels restart. Parameter is the name of an application.*/
"CANCELLED_INFO_MESSAGE_RESTART"	 = "Yritä uudelleen lopettamalla %@ ja valitsemalla Omenavalikosta Käynnistä uudelleen.";
"CANCELLED_INFO_MESSAGE_UNKNOWN_RESTART"	 = "Yritä uudelleen valitsemalla Omenavalikosta Käynnistä uudelleen.";



/* Alert text when an app cancels shutdown. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE_SHUTDOWN"	 = "Ohjelma %@ kumosi sammutuksen.";

/* Alert text when an unknown app cancels shutdown. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE_UNKNOWN_SHUTDOWN"	 = "Ohjelma on kumonnut sammutuksen.";

/* Info text when an app cancels shutdown. Parameter is the name of an application.*/
"CANCELLED_INFO_MESSAGE_SHUTDOWN"	 = "Yritä uudelleen lopettamalla %@ ja valitsemalla Omenavalikosta Sammuta.";
"CANCELLED_INFO_MESSAGE_UNKNOWN_SHUTDOWN"	 = "Yritä uudelleen valitsemalla Omenavalikosta Sammuta.";



/*** Ickiness with the Finder ***/
/* FINDER_FAILED_MESSAGE */
"FINDER_FAILED_MESSAGE"	=	"Finderia ei voitu käynnistää, koska on ilmennyt vakava ongelma.";


"APP_DIED_ALERT_MESSAGE"		=   "Ohjelma %@ on yllättäen keskeyttänyt toimintansa.";

/* Info text when an app dies*/
"APP_DIED_INFO_MESSAGE"		=   "Ei vaikutusta järjestelmään tai muihin ohjelmiin.";


/*** Alert button titles ***/

/*Alert panel button title*/
"OK_BUTTON"		=	"OK";

/*Alert panel button title*/
"CANCEL_BUTTON"		=	"Kumoa";

/*Alert panel button title*/
/*"CONTINUE"		=	"Continue to Logout";*/

/*Alert panel button title*/
"SHUTDOWN_BUTTON"		=	"Sammuta";

/*Alert panel button title*/
"RESTART_BUTTON"		=	"Käynnistä uudelleen";

/*Alert panel button title*/
"SLEEP_BUTTON"		=	"Nuku";

/* Logout Button */
/*"LOGOUT_BUTTON"		=	"Log Out";*/

/* Force Quit Button */
"FORCEQUIT_BUTTON"	=	"Pakota lopettamaan";

/* Terminate button */
"TERMINATE_BUTTON"	=	"Pakota lopettamaan";

/*Relaunch Button - this is the Finder relaunch button in the Process Panel*/
"RELAUNCH_BUTTON"	=	"Avaa uudelleen";

/*Pause Button - This is the text that shows in the Pause button when the current app is not paused*/
"PAUSE_BUTTON"		=	"Keskeytä";

/*Pause Button - This is the text that shows in the Pause button when the current app is not paused*/
"RESUME_BUTTON"	=	"Jatka";

/*Message in alert to confirm that the user wants to shut down*/
"SHUTDOWN_MESSAGE"	= 	"Haluatko varmasti sammuttaa tietokoneen nyt?";

/*Message in alert to confirm that the user wants to restart*/
"RESTART_MESSAGE"	= 	"Haluatko varmasti käynnistää tietokoneen uudelleen?";

/*Message in alert to confirm that the user wants to log out*/
"LOGOUT_MESSAGE"	=	"Haluatko varmasti lopettaa kaikki ohjelmat ja kirjautua ulos?";

/*Message in alert to indicate a scheduled sleep is occuring*/
"SCHEDULED_SLEEP_MESSAGE" = "Tietokone on ajastettu menemään nukkumaan automaattisesti.";

/*Message in alert to indicate a scheduled shutdown is occuring*/
"SCHEDULED_SHUTDOWN_MESSAGE" = "Tietokone on ajastettu sammumaan automaattisesti.";

/*Message in alert to indicate a scheduled restart  is occuring*/
"SCHEDULED_RESTART_MESSAGE" = "Tietokone on ajastettu käynnistymään uudelleen automaattisesti.";

/****************************************************************************/
/* Time formats and strings for logout, shutdown and restart time phrases   */
/****************************************************************************/

/*Plural Minutes Plural Seconds %1$d = minutes (greater than 1).  %2$d = number of seconds (greater than 1) */
"TIME_FORMAT_22" = "%1$d minuutin ja %2$d sekunnin";

/*Plural Minutes Single Second.  %d = number of minutes (greater than 1) */
"TIME_FORMAT_21" = "%d minuutin ja 1 sekunnin";

/*Plural Minutes Zero Seconds. %d = number of minutes (greater than 1) */
"TIME_FORMAT_20" = "%d minuutin";

/*Single Minute Plural Seconds. %d = number of seconds (greater than 1) */
"TIME_FORMAT_12" = "1 minuutin ja %d sekunnin";

/*Single Minute Single Second. */
"TIME_FORMAT_11" = "1 minuutin ja 1 sekunnin";

/*Single Minute Zero Seconds. */
"TIME_FORMAT_10" = "1 minuutin";

/*Zero Minutes Plural Seconds %d = number of seconds (greater than 1) */
"TIME_FORMAT_2" = "%d sekunnin";

/*Zero Minutes One Second*/
"TIME_FORMAT_1" = "1 sekunnin";

/*Zero Minutes Zero Seconds*/
"TIME_FORMAT_0" = "0 sekunnin";


/******************************************/
/* Timed logout/shutdown/restart messages */
/******************************************/

/* Timed logout message. %@ is replaced by one of the time phrases above. */
"WILL_LOGOUT_INFO" = "Jos tietokoneella ei tehdä mitään, käyttäjä kirjautuu automaattisesti ulos %@ kuluttua.";

/* Timed shutdown message. %@ is replaced by one of the time phrases above. */
"WILL_SHUTDOWN_INFO" = "Jos et tee mitään, tietokone sammuu automaattisesti %@ kuluttua.";

/* Timed restart message. %@ is replaced by one of the time phrases above. */
"WILL_RESTART_INFO" = "Jos et tee mitään, tietokone käynnistyy automaattisesti uudelleen %@ kuluttua.";

/* Timed Scheduled shutdown message. %@ is replaced by one the the time phrases above. */
"WILL_SCHEDULED_SHUTDOWN_INFO" = "Jos et tee mitään, tietokone sammuu automaattisesti %@ kuluttua.";

/* Timed Scheduled shutdown message. %@ is replaced by one the the time phrases above. */
"WILL_SCHEDULED_SLEEP_INFO" = "Jos et tee mitään, tietokone menee nukkumaan automaattisesti %@ kuluttua.";

/* Timed Scheduled restart message. %@ is replaced by one the the time phrases above. */
"WILL_SCHEDULED_RESTART_INFO" = "Jos et tee mitään, tietokone käynnistyy automaattisesti uudelleen %@ kuluttua.";


/******************************************/
/* Guest account related strings          */
/******************************************/
"GUEST_ACCOUNT_SHUTDOWN_MESSAGE" = "Jos sammutat tietokoneen, tiedostot poistetaan.";

"GUEST_ACCOUNT_SHUTDOWN_INFO_MESSAGE" = "Olet kirjautuneena sisään vieraana. Sammuttaminen poistaa kaikki tiedot ja tiedostot vieraan kotikansiosta. Tiedostoja ei voida palauttaa.";

"GUEST_ACCOUNT_RESTART_MESSAGE" = "Jos käynnistät uudelleen, tiedostosi poistetaan.";

"GUEST_ACCOUNT_RESTART_INFO_MESSAGE" = "Olet kirjautuneena sisään vieraana. Uudelleenkäynnistäminen poistaa kaikki tiedot ja tiedostot vieraan kotikansiosta. Tiedostoja ei voida palauttaa.";

"GUEST_ACCOUNT_LOGOUT_MESSAGE" = "Jos kirjaudut ulos, tiedostot poistetaan.";

"GUEST_ACCOUNT_LOGOUT_BUTTON_TEXT" = "Poista tiedostot ja kirjaudu ulos";

"GUEST_ACCOUNT_RESTART_BUTTON_TEXT" = "Poista tiedostot ja käynnistä uudelleen";

"GUEST_ACCOUNT_SHUTDOWN_BUTTON_TEXT" = "Poista tiedostot ja sammuta";

/*Password Hint*/
/*"PASSWORD_HINT_TEXT"	=	"You've entered an invalid password 3 times.";*/

/*"FORCEQUIT"		=	 "Force Quit...";*/

/*"LOGGINGIN"		=	 "Logging In...";*/

/* tesxt for go back button when password field is displayed*/

/*"BACKTOLIST"			=		"Go Back";*/

/*"OTHERUSER"			=		"Other...";*/

/*"NAME"			=		"Name";*/

/*Disk Full First Message*/
/*"DISKFULLMESSAGE1"		= "Your hard disk has no more space available for application memory. Quit some applications immediately, or your computer will have problems.";*/

/*Disk Full First Instructional Text*/
/*"DISKFULLINSTRUCT1"		=    "Closing windows and removing files from your hard disk may also help." ;*/

/*Empty Trash*/
/*"EMPTYTRASH" 		=    "Empty Trash";*/

// unknown ( for unknown library, appliction name etc.)
"UNKNOWN" = "tuntematon";

/****** Bad Time Set by User *************/

"ILLEGAL_TIME_TITLE" = "Tietokoneesi kello on asetettu aikaan ennen 1.1.2008. Tämän vuoksi jotkin ohjelmat saattavat käyttäytyä ennalta-arvaamattomasti.";

"ILLEGAL_TIME_MESSAGE" = "Aseta kellonaika käsin avaamalla Päiväys ja aika -asetukset. Lisätietoja saat valitsemalla Mac-ohjeet Ohjeet-valikosta.";


/****** Users Connected *************/

/* Message when AFP users are connected on shutdown and restart*/

"AFP_USERS_CONNECTED" = "AFP-käyttäjiä on yhteydessä koneelle";
"AFP_USERS_CONNECTED_RESTART_TITLE" = "Haluatko varmasti käynnistää tietokoneen uudelleen?";
"AFP_USERS_CONNECTED_SHUTDOWN_TITLE" = "Haluatko varmasti sammuttaa tietokoneen nyt?";

/*Info when AFP users are connected on shutdown */
"AFP_USERS_CONNECTED_SHUTDOWN_INFO" = "%d muuta käyttäjää on yhteydessä tietokoneelle tiedostojaon avulla. ";
"AFP_SINGLE_USER_CONNECTED_SHUTDOWN_INFO" = "Yksi käyttäjä on yhteydessä tietokoneelle tiedostojaon avulla.";

/* Info when AFP users are connected on restart */
"AFP_USERS_CONNECTED_RESTART_INFO" = "%d muuta käyttäjää on yhteydessä tietokoneelle tiedostojaon avulla. ";
"AFP_SINGLE_USER_CONNECTED_RESTART_INFO" = "Yksi käyttäjä on yhteydessä tietokoneelle tiedostojaon avulla.";

/********** Screen Lock Password **********/

/* Message for unlocking the screen lock modal dialog */
/* It should not mention anything about the METHOD for authentication */
/* such as entering as password. Instructions regarding the method for */
/* for authentication will be appended by the SecurityAgent */
"Enter your password to unlock the screen."="Syötä salasana ruudun lukituksen poistamiseksi.";

/**********Disk Messages ******************/

/*"DISKFULLMESSAGE2" 		=  "Your boot volume has no space available, and your computer is having problems. You may want to force quit some applications to avoid further problems.";*/

/*"DISKFULLINSTRUCT2"		=  "Closing windows and removing files from your hard disk may also help.";*/

/*"REPLACE_HOMEFOLDER_TEXT"	=	" The %@ folder for user %@ cannot be found in its usual location.";*/

/*"REPLACE_HOMEFOLDER_INFO_TEXT" =  "The \"Home\" or \"Users\" folder may have been moved or deleted. If \"Home\" is located on the network, the server may be temporarily unavailable. Contact your administrator if this problem continues.";*/

"APP_NOT_RESPONDING_SUFFIX"	= " (Ei vastaa)";

"APP_PAUSED_SUFFIX" = " (keskeytetty)";

"APP_THROTTLED_SUFFIX" = " (rajoitettu)";

/********** AFP/SMB Login Error Messages *********/

/* Format string used to build primary message string of alert that is presented when an error occurs mounting an AFP or SMB home directory. */
/* %@ is replaced with the name of the user account. */

"AFP_SMB_LOGIN_ERROR_MESSAGE_FORMAT" = "Et pysty nyt kirjautumaan sisään käyttäjätunnuksella \"%@\"";

/* Info string (secondary message) of alert that is presented when an error ocurs mounting an AFP or SMB home directory. */
"AFP_SMB_LOGIN_ERROR_INFO" = "Kirjautuminen epäonnistui virheen takia. Käyttäjätunnuksen kotikansio, jolle yritit kirjautua sisään, sijaitsee AFP- tai SMB-palvelimella. Lisätietoja saat järjestelmän ylläpitäjältä.";

/* Label for OK button in alert that is presented when an error ocurs mounting an AFP or SMB home directory. */
"AFP_SMB_LOGIN_ERROR_OK_BUTTON" = "OK";
